[{"title": "Celebrate Mars Reconnaissance Orbiter's Views From Above", "preview": "Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."}, {"title": "NASA's Curiosity Mars Rover Snaps Its Highest-Resolution Panorama Yet", "preview": "To go along with the stunning 1.8-billion-pixel image, a new video offers a sweeping view of the Red Planet."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}, {"title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation", "preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."}, {"title": "MOXIE Could Help Future Rockets Launch Off Mars", "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."}, {"title": "NASA's Perseverance Rover Is Midway to Mars ", "preview": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."}, {"title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "}, {"title": "NASA's Curiosity Keeps Rolling As Team Operates Rover From Home", "preview": "The team has learned to meet new challenges as they work remotely on the Mars mission."}, {"title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"title": "Space History Is Made in This NASA Robot Factory", "preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."}, {"title": "6 Things to Know About NASA's Ingenuity Mars Helicopter", "preview": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."}, {"title": "NASA's Perseverance Rover Attached to Atlas V Rocket", "preview": "Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."}, {"title": "Independent Review Indicates NASA Prepared for Mars Sample Return Campaign", "preview": "NASA released an independent review report Tuesday indicating the agency is well positioned for its Mars Sample Return campaign to bring pristine samples from Mars to Earth for scientific study."}, {"title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."}]